In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                   'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                   'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                   'Airline':['KLM(!)','<Air France> (12)','(British Airways. )','12.Air France','"Swiss Air"']})

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df[['From','To']] = df['From_To'].str.split('_',expand=True)
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

In [ ]:
df['From']=df['From'].str.capitalize()
df['To']=df['To'].str.capitalize()
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN           NaN  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis           NaN  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

In [ ]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]        12.Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [ ]:
df.drop('RecentDelays',axis=1,inplace=True)
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0       10045.0               KLM(!)    London  ...    23.0     47.0      NaN
1           NaN    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2       10065.0  (British Airways. )    London  ...    24.0     43.0     87.0
3           NaN        12.Air France  Budapest  ...    13.0      NaN      NaN
4       10085.0          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]

In [10]:
for i in range(df.shape[0]):
    if np.isnan(df.loc[i, 'FlightNumber']):
        df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber']+10.0

In [11]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [12]:
df['FlightNumber']=df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]        12.Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"